Revit 2027 API
AnalysisDisplayLegendSettings(AnalysisDisplayLegendSettings) Constructor
 Constructs a new copy of the input AnalysisDisplayLegendSettings object.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayLegendSettings(
	AnalysisDisplayLegendSettings other
)
Public Sub New (
	other As AnalysisDisplayLegendSettings
)
public:
AnalysisDisplayLegendSettings(
	AnalysisDisplayLegendSettings^ other
)
new :
        other : AnalysisDisplayLegendSettings -> AnalysisDisplayLegendSettings
Parameters
other AnalysisDisplayLegendSettings
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalysisDisplayLegendSettings Class
AnalysisDisplayLegendSettings Overload
Autodesk.Revit.DB.Analysis Namespace